Theshi/stm32_portfolio/05-天气时钟完整/Driver/W25Q64/W25Q64.h
/**
 * ============================================================================
 * Driver/W25Q64.h —— W25Q64 Flash 不定量数据写入管理系统 头文件
 * ============================================================================
 *
 * 【本头文件的作用】
 *   - 定义 Flash 的物理参数（容量、扇区大小、页大小）
 *   - 规划 Flash 存储分区（目录区 + 数据区）
 *   - 定义"目录项"数据结构（登记本的每一行）
 *   - 声明所有操作函数
 *
 * 【与 BSP 层的关系】
 *   BSP/bsp_spi.h  —— 定义 SPI 引脚和 W25Q64 命令码（底层硬件）
 *   Driver/W25Q64.h —— 定义存储管理结构和接口函数（中层算法）
 *
 *   调用关系：main.c → Driver/W25Q64.h → BSP/bsp_spi.h → stm32f10x.h
 * ============================================================================
 */

#ifndef __W25Q64_H
#define __W25Q64_H

#include "stm32f10x.h"
#include "bsp_spi.h"          /* 依赖 BSP 层的 SPI 宏和函数 */

#define W25Q64_TOTAL_SIZE         (8 * 1024 * 1024)    /* 总容量: 8MB          */
#define W25Q64_SECTOR_SIZE        (4 * 1024)           /* 扇区大小: 4KB        */
#define W25Q64_BLOCK_SIZE         (64 * 1024)           /* 块大小: 64KB        */
#define W25Q64_PAGE_SIZE          256                   /* 页大小: 256 字节     */
#define W25Q64_SECTOR_COUNT       2048                  /* 扇区总数: 8MB÷4KB   */
#define W25Q64_PAGE_COUNT         32768                 /* 页总数: 8MB÷256B    */
#define W25Q64_PAGES_PER_SECTOR   16                    /* 每扇区 16 页        */

/*===========================================================================
 * 第二部分：Flash 分区规划 —— "仓库布局"
 *
 * 【教学 —— 为什么要分区？】
 *
 *   Flash 就像一个空仓库，我们要在里面放各种大小不一的货物（字库、图片等）。
 *   如果啥也不管直接把数据往里面塞，那之后根本找不到哪块数据在哪。
 *
 *   所以要在仓库最前面划出一小块地方作为"登记本"（目录区），
 *   每次放一个货物就在登记本上记一笔：货号、大小、放在哪个位置。
 *
 *   ┌──────────────────┬──────────────────────────────────────────┐
 *   │   目录区  16KB    │              数据区  ≈ 8MB              │
 *   │  (货物登记本)     │          (实际货物存放的仓库)            │
 *   │  128条记录        │                                        │
 *   │  每条 16字节      │                                        │
 *   └──────────────────┴──────────────────────────────────────────┘
 *   0x000000          0x004000                          0x800000
 *===========================================================================*/

/* ---- 目录区 ---- */
#define W25Q64_DIR_START_ADDR     0x000000            /* 目录区起始地址           */
#define W25Q64_DIR_SIZE            W25Q64_SECTOR_SIZE /* 目录区: 4KB        */
#define W25Q64_DIR_SECTOR_COUNT   1                   /* 目录区占 1 个扇区       */
#define W25Q64_DIR_MAX_ENTRIES    128                 /* 最多存 128 个文件的记录 */

/* ---- 数据区 ---- */
#define W25Q64_DATA_START_ADDR    (W25Q64_DIR_START_ADDR + W25Q64_DIR_SIZE)
#define W25Q64_DATA_TOTAL_SIZE    (W25Q64_TOTAL_SIZE - W25Q64_DIR_SIZE)

/*===========================================================================
 * 第三部分：状态寄存器位定义
 *
 * 【教学 —— 状态寄存器怎么用？】
 *   W25Q64 内部有一个 8 位的状态寄存器，我们主要关心 2 个位：
 *     BIT0 (BUSY): 1=Flash 正忙（正在擦除/写入），0=空闲
 *     BIT1 (WEL):  1=写使能已打开，0=写禁止
 *   每次擦除/写入前要先查 BUSY 是否为 0。
 *===========================================================================*/
#define W25Q64_SR_BUSY            0x01    /* 忙标志位 (Write In Progress) */
#define W25Q64_SR_WEL             0x02    /* 写使能锁存 (Write Enable Latch) */

/*===========================================================================
 * 第四部分：目录项结构体 —— "登记本的每一行"
 *===========================================================================*/
#pragma pack(1)  /* 强制 1 字节对齐，保证结构体刚好 16 字节 */
typedef struct {
    uint8_t   used;           /* 使用标志: 0x00=空, 0x5A=已用, 0xA5=已删除 */
    uint16_t  id;             /* 数据编号（用户自定义）                     */
    uint32_t  size;           /* 数据实际大小（字节）                       */
    uint32_t  start_addr;     /* 在 Flash 数据区中的起始地址                */
    uint16_t  crc16;          /* 数据的 CRC16-CCITT 校验值                  */
    uint8_t   reserved[4];    /* 保留                                       */
} W25Q64_DirEntry_t;          /* 共计 16 字节                               */
#pragma pack()

/*===========================================================================
 * 第五部分：函数声明
 *===========================================================================*/

/* ---------- 底层驱动函数（直接操作 Flash 芯片） ---------- */
void     W25Q64_Init(void);                                    /* 初始化 SPI + Flash     */
uint32_t W25Q64_ReadID(void);                                 /* 读芯片 ID              */
uint8_t  W25Q64_ReadSR(void);                                 /* 读状态寄存器           */
void     W25Q64_WriteEnable(void);                            /* 写使能                 */
void     W25Q64_WaitBusy(void);                               /* 等待不忙               */
void     W25Q64_SectorErase(uint32_t addr);                  /* 扇区擦除 4KB           */
void     W25Q64_BlockErase(uint32_t addr);                    /* 块擦除 64KB            */
void     W25Q64_ChipErase(void);                              /* 整片擦除               */
void     W25Q64_PageWrite(uint32_t addr, const uint8_t *buf, uint16_t len); /* 页写入 */
void     W25Q64_Read(uint32_t addr, uint8_t *buf, uint32_t len);           /* 任意读 */

/* ---------- 文件管理层函数（本算法的核心接口） ---------- */
void     W25Q64_FileSysInit(void);                            /* 初始化文件系统         */
int32_t  W25Q64_FileWrite(uint16_t id, const uint8_t *data, uint32_t size); /* 写入文件  */
int32_t  W25Q64_FileRead(uint16_t id, uint8_t *buf, uint32_t buf_size, uint32_t *actual_size);
int32_t  W25Q64_FileDelete(uint16_t id);                     /* 删除文件               */
int32_t  W25Q64_GetFreeSpace(void);                           /* 获取剩余空间（字节）   */
void     W25Q64_Format(void);                                 /* 格式化（擦除全部）     */

/* ---------- 流式写入接口（串口烧录用） ---------- */
int32_t  W25Q64_StreamStart(uint16_t id, uint32_t size);
int32_t  W25Q64_StreamFeed(const uint8_t *data, uint16_t len);
int32_t  W25Q64_StreamEnd(void);
uint8_t  W25Q64_StreamIsDone(void);    /* 查询是否已全部写完 */
int32_t  W25Q64_GetFileAddr(uint16_t id, uint32_t *addr, uint32_t *size); /* 查文件地址 */

/* ---------- 工具函数 ---------- */
uint16_t W25Q64_CRC16(const uint8_t *data, uint32_t len);    /* CRC16 校验计算         */
uint16_t W25Q64_CRC16_Update(uint16_t crc, const uint8_t *data, uint32_t len); /* 分步 CRC */

#endif /* __W25Q64_H */
